<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Наступні мовні рядки містять повідомлення за замовчуванням, що використовуються
    | класом, що перевіряє значення (валідатором). Деякі з правил мають
    | кілька версій, наприклад, size. Ви можете поміняти їх на будь-які
    | інші, які краще підходять для вашої програми.
    |
    */

    'accepted' => 'Ви повинні прийняти :attribute.',
    'active_url' => 'Поле :attribute містить недійсний URL.',
    'after' => 'У полі :attribute має бути дата більша за :date.',
    'after_or_equal' => 'У полі :attribute має бути дата більша або дорівнювати :date.',
    'alpha' => 'Поле :attribute може містити тільки букви.',
    'alpha_dash' => 'Поле :attribute може містити тільки букви, цифри, дефіс і нижнє підкреслення.',
    'alpha_num' => 'Поле :attribute може містити тільки букви та цифри.',
    'array' => 'Поле :attribute має бути масивом.',
    'before' => 'У полі :attribute має бути дата раніше :date.',
    'before_or_equal' => 'У полі :attribute має бути дата раніше або дорівнювати :date.',
    'between' => [
        'numeric' => 'Поле :attribute має бути між :min і :max.',
        'file' => 'Розмір файлу в полі :attribute має бути між :min і :max Кілобайт(а).',
        'string' => 'Кількість символів у полі :attribute має бути між :min і :max.',
        'array' => 'Кількість елементів у полі :attribute має бути між :min і :max.',
    ],
    'boolean' => 'Поле :attribute повинно мати значення логічного типу.',
    'confirmed' => 'Поле :attribute не збігається з підтвердженням.',
    'date' => 'Поле :attribute не є датою.',
    'date_equals' => 'Поле :attribute має бути датою, що дорівнює :date.',
    'date_format' => 'Поле :attribute не відповідає формату :format.',
    'different' => 'Поля :attribute і :other повинні відрізнятися.',
    'digits' => 'Довжина цифрового поля :attribute має бути :digits.',
    'digits_between' => 'Довжина цифрового поля :attribute має бути між :min і :max.',
    'dimensions' => 'Поле :attribute має неприпустимі розміри зображення.',
    'distinct' => 'Поле :attribute містить повторюване значення.',
    'email' => 'Поле :attribute має бути дійсною електронною адресою.',
    'ends_with' => 'Поле :attribute повинно закінчуватися одним із таких значень: :values',
    'exists' => 'Обране значення для :attribute некоректне.',
    'file' => 'Поле :attribute має бути файлом.',
    'filled' => 'Поле :attribute обов`язкове для заповнення.',
    'gt' => [
        'numeric' => 'Поле :attribute має бути більшим за :value.',
        'file' => 'Розмір файлу в полі :attribute має бути більшим за :value Кілобайт(а).',
        'string' => 'Кількість символів у полі :attribute має бути більшою за :value.',
        'array' => 'Кількість елементів у полі :attribute має бути більшою за :value.',
    ],
    'gte' => [
        'numeric' => 'Поле :attribute має бути :value або більше.',
        'file' => 'Розмір файлу в полі :attribute має бути :value Кілобайт(а) або більше.',
        'string' => 'Кількість символів у полі :attribute має бути :value або більше.',
        'array' => 'Кількість елементів у полі :attribute має бути :value або більше.',
    ],
    'image' => 'Поле :attribute має бути зображенням.',
    'in' => 'Обране значення для :attribute помилкове.',
    'in_array' => 'Поле :attribute не існує в :other.',
    'integer' => 'Поле :attribute має бути цілим числом.',
    'ip' => 'Поле :attribute має бути дійсною IP-адресою.',
    'ipv4' => 'Поле :attribute має бути дійсною IPv4-адресою.',
    'ipv6' => 'Поле :attribute має бути дійсною IPv6-адресою.',
    'json' => 'Поле :attribute має бути JSON рядком.',
    'lt' => [
        'numeric' => 'Поле :attribute має бути меншим за :value.',
        'file' => 'Розмір файлу в полі :attribute має бути менше :value Кілобайт(а).',
        'string' => 'Кількість символів у полі :attribute має бути меншою за :value.',
        'array' => 'Кількість елементів у полі :attribute має бути меншою за :value.',
    ],
    'lte' => [
        'numeric' => 'Поле :attribute має бути :value або менше.',
        'file' => 'Розмір файлу в полі :attribute дол.',
        'string' => 'Кількість символів у полі :attribute має бути :value або менше.',
        'array' => 'Кількість елементів у полі :attribute має бути :value або менше.',
    ],
    'max' => [
        'numeric' => 'Поле :attribute не може бути більшим за :max.',
        'file' => 'Розмір файлу в полі :attribute не може бути більше :max Кілобайт(а).',
        'string' => 'Кількість символів у полі :attribute не може перевищувати :max.',
        'array' => 'Кількість елементів у полі :attribute не може перевищувати :max.',
    ],
    'mimes' => 'Поле :attribute має бути файлом одного з таких типів: :values.',
    'mimetypes' => 'Поле :attribute має бути файлом одного з таких типів: :values.',
    'min' => [
        'numeric' => 'Поле :attribute має бути не меншим за :min.',
        'file' => 'Розмір файлу в полі :attribute має бути не менше :min Кілобайт(а).',
        'string' => 'Кількість символів у полі :attribute має бути не менше :min.',
        'array' => 'Кількість елементів у полі :attribute має бути не менше :min.',
    ],
    'not_in' => 'Обране значення для :attribute помилкове.',
    'not_regex' => 'Обраний формат для :attribute помилковий.',
    'numeric' => 'Поле :attribute має бути числом.',
    'password' => 'Невірний пароль.',
    'present' => 'Поле :attribute має бути присутнім.',
    'regex' => 'Поле :attribute має помилковий формат.',
    'required' => 'Поле :attribute обов`язкове для заповнення.',
    'required_if' => 'Поле :attribute обов`язкове для заповнення, коли :other дорівнює :value.',
    'required_unless' => 'Поле :attribute обов`язкове для заповнення, коли :other не дорівнює :values.',
    'required_with' => 'Поле :attribute обов`язкове для заповнення, коли :values вказано.',
    'required_with_all' => 'Поле :attribute обов`язкове для заповнення, коли :values вказано.',
    'required_without' => 'Поле :attribute обов`язкове для заповнення, коли :values не вказано.',
    'required_without_all' => 'Поле :attribute обов`язкове для заповнення, коли жодне з :values не вказано.',
    'same' => 'Значення полів :attribute і :other повинні збігатися.',
    'size' => [
    'numeric' => 'Поле :attribute має дорівнювати :size.',
    'file' => 'Розмір файлу в полі :attribute має дорівнювати :size Кілобайт(а).',
    'string' => 'Кількість символів у полі :attribute має дорівнювати :size.',
    'array' => 'Кількість елементів у полі :attribute має дорівнювати :size.',
],
    'starts_with' => 'Поле :attribute має починатися з одного з таких значень: :values',
    'string' => 'Поле :attribute має бути рядком.',
    'timezone' => 'Поле :attribute має бути дійсним часовим поясом.',
    'unique' => 'Таке значення поля :attribute вже існує.',
    'uploaded' => 'Завантаження поля :attribute не вдалося.',
    'url' => 'Поле :attribute має помилковий формат URL.',
    'uuid' => 'Поле :attribute має бути коректним UUID.',

    'parent_id' => 'Поле ":attribute" має неприпустиме значення',

    /*
    |--------------------------------------------------------------------------
    | Власні мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Тут Ви можете вказати власні повідомлення для атрибутів.
    | Це дозволяє легко вказати своє повідомлення для заданого правила атрибута.
    |
    | http://laravel.com/docs/validation#custom-error-messages
    | Приклад використання
    |
    | 'custom' => [
    | 'email' => [
    | 'required' => 'Нам необхідно знати Вашу електронну адресу!',
    | ],
    | ],
    |
    */

    'custom' => [
    'name' => [
        'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'max' => 'Поле ":attribute" має бути не більше :max символів',
        ],
        'email' => [
            'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'max' => 'Поле ":attribute" має бути не більше :max символів',
        ],
        'phone' => [
    'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'max' => 'Поле ":attribute" має бути не більше :max символів',
        ],
        'address' => [
            'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'max' => 'Поле ":attribute" має бути не більше :max символів',
        ],
        'slug' => [
    'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'unique' => 'Поле ":attribute" має бути унікальним значенням',

            'regex' => 'Поле ":attribute" допускає тільки букви, цифри',
            'max' => 'Поле ":attribute" має бути не більше :max символів',
        ],
        'parent_id' => [
            'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'regex' => 'Поле ":attribute" має бути цілим позитивним числом',
            'invalid' => 'Категорію не можна помістити всередину самої себе',
        ],
        'category_id' => [
    'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'integer' => 'Поле ":attribute" має бути цілим позитивним числом',
            'min' => 'Поле ":attribute" обов`язкове для заповнення',
        ],
        'brand_id' => [
    'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'integer' => 'Поле ":attribute" має бути цілим позитивним числом',
            'min' => 'Поле ":attribute" обов`язкове для заповнення',
        ],
        'price' => [
    'required' => 'Поле ":attribute" обов`язкове для заповнення',
            'numeric' => 'Поле ":attribute" має бути позитивним числом',
            'min' => 'Поле ":attribute" не може бути меншим за :min',
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Власні назви атрибутів
    |--------------------------------------------------------------------------
    |
    | Наступні рядки використовуються для підміни програмних імен елементів
    | призначеного для користувача інтерфейсу на легкочитабельні. Наприклад, замість імені
    | поля "email" у повідомленнях буде виводитися "електронна адреса".
    |
    | Приклад використання
    |
    | 'attributes' => [
    | 'email' => 'електронна адреса',
    | ],
    |
    */

    'attributes' => [
        'name' => 'Ім`я, Прізвище',
        'slug' => 'ЧПУ (англ)',
        'username' => 'Нікнейм',
        'email' => 'Адреса пошти',
        'first_name' => 'Ім`я',
        'last_name' => 'Прізвище',
        'password' => 'Пароль',
        'password_confirmation' => 'Підтвердження пароля',
        'city' => 'Місто',
        'country' => 'Країна',
        'address' => 'Адреса доставки',
        'phone' => 'Номер телефону',
        'mobile' => 'Моб. номер',
        'age' => 'Вік',
        'sex' => 'Стать',
        'gender' => 'Стать',
        'day' => 'День',
        'month' => 'Місяць',
        'year' => 'Рік',
        'hour' => 'Час',
        'minute' => 'Хвилина',
        'second' => 'Секунда',
        'title' => 'Найменування',
        'content' => 'Контент',
        'description' => 'Опис',
        'excerpt' => 'Витяг',
        'date' => 'Дата',
        'time' => 'Час',
        'available' => 'Доступно',
        'size' => 'Розмір',
        'parent_id' => 'Батько',
        'category_id' => 'Категорія',
        'brand_id' => 'Бренд',
        'price' => 'Ціна',
    ],
];
