<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Наступні мовні рядки містять повідомлення за замовчуванням, що використовуються
    | класом, що перевіряє значення (валідатором). Деякі з правил мають
    | кілька версій, наприклад, size. Ви можете поміняти їх на будь-які
    | інші, які краще підходять для вашої програми.
    |
    */

    'accepted' => 'Повинно бути прийнято.',
    'active_url' => 'Недійсний URL.',
    'after' => 'Дата повинна бути більшою за :date.',
    'after_or_equal' => 'Дата повинна бути більшою або дорівнювати :date.',
    'alpha' => 'Тут можуть бути тільки літери.',
    'alpha_dash' => 'Тут можуть бути тільки букви, цифри, дефіс і нижнє підкреслення.',
    'alpha_num' => 'Тут можуть бути тільки букви і цифри.',
    'array' => 'Тут має бути масив.',
    'before' => 'Дата тут має бути раніше :date.',
    'before_or_equal' => 'Дата тут має бути раніше або дорівнювати :date.',
    'between' => [
        'numeric' => 'Значення має бути між :min і :max.',
        'file' => 'Розмір файлу має бути між :min і :max Кілобайт(а).',
        'string' => 'Кількість символів має бути між :min і :max.',
        'array' => 'Кількість елементів має бути між :min і :max.',
    ],
    'boolean' => 'Поле повинно мати значення логічного типу.',
    'confirmed' => 'Не збігається з підтвердженням.',
    'date' => 'Не є датою.',
    'date_equals' => 'Дата повинна дорівнювати :date.',
    'date_format' => 'Не відповідає формату :format.',
    'different' => 'Значення має відрізнятися від :other',
    'digits' => 'Довжина повинна бути :digits.',
    'digits_between' => 'Довжина повинна бути між :min і :max.',
    'dimensions' => 'Зображення має неприпустимі розміри.',
    'distinct' => 'Поле містить повторюване значення.',
    'email' => 'Електронна адреса має бути дійсною.',
    'ends_with' => 'Повинно закінчуватися одним із таких значень: :values',
    'exists' => 'Обране значення некоректне.',
    'file' => 'Вміст має бути файлом.',
    'filled' => 'Обов`язково для заповнення.',
    'gt' => [
        'numeric' => 'Значення має бути більшим за :value.',
        'file' => 'Розмір файлу повинен бути більше :value Кілобайт(а).',
        'string' => 'Кількість символів має бути більшою за :value.',
        'array' => 'Кількість елементів має бути більшою за :value.',
    ],
    'gte' => [
        'numeric' => 'Значення має бути :value або більше.',
        'file' => 'Розмір файлу повинен бути :value Кілобайт(а) або більше.',
        'string' => 'Кількість символів має бути :value або більше.',
        'array' => 'Кількість елементів має бути :value або більше.',
    ],
    'image' => 'Тут має бути зображення.',
    'in' => 'Обране значення помилкове.',
    'in_array' => 'Значення не існує в :other.',
    'integer' => 'Повинно бути ціле число.',
    'ip' => 'Повинна бути дійсна IP-адреса.',
    'ipv4' => 'Повинна бути дійсна IPv4-адреса.',
    'ipv6' => 'Повинна бути дійсна IPv6-адреса.',
    'json' => 'Повинно бути JSON рядком.',
    'lt' => [
        'numeric' => 'Значення має бути меншим за :value.',
        'file' => 'Розмір файлу повинен бути менше :value Кілобайт(а).',
        'string' => 'Кількість символів має бути менше :value.',
        'array' => 'Кількість елементів має бути менше :value.',
    ],
    'lte' => [
        'numeric' => 'Значення має бути :value або менше.',
        'file' => 'Розмір файлу має бути :value Кілобайт(а) або менше.',
        'string' => 'Кількість символів має бути :value або менше.',
        'array' => 'Кількість елементів має бути :value або менше.',
    ],
    'max' => [
        'numeric' => 'Значення не може бути більшим за :max.',
        'file' => 'Розмір файлу не може бути більшим за :max Кілобайт(а).',
        'string' => 'Кількість символів не може перевищувати :max.',
        'array' => 'Кількість елементів не може перевищувати :max.',
    ],
    'mimes' => 'Повинен бути файл одного з таких типів: :values.',
    'mimetypes' => 'Повинен бути файл одного з таких типів: :values.',
    'min' => [
        'numeric' => 'Значення має бути не менше :min.',
        'file' => 'Розмір файлу повинен бути не менше :min Кілобайт(а).',
        'string' => 'Кількість символів має бути не менше :min.',
        'array' => 'Кількість елементів має бути не менше :min.',
    ],
    'not_in' => 'Обране значення помилкове.',
    'not_regex' => 'Обраний формат помилковий.',
    'numeric' => 'Тут має бути число.',
    'password' => 'Невірний пароль.',
    'present' => 'Значення має бути.',
    'regex' => 'Помилковий формат.',
    'required' => 'Обов`язково для заповнення.',
    'required_if' => 'Обов`язково для заповнення, коли :other дорівнює :value.',
    'required_unless' => 'Обов`язково для заповнення, коли :other не дорівнює :values.',
    'required_with' => 'Обов`язково для заповнення, коли :values вказано.',
    'required_with_all' => 'Обов`язково для заповнення, коли :values вказано.',
    'required_without' => 'Обов`язково для заповнення, коли :values не вказано.',
    'required_without_all' => 'Обов`язково для заповнення, коли жодне з :values не вказано.',
    'same' => 'Значення має збігатися з :other.',
    'size' => [
        'numeric' => 'Значення має дорівнювати :size.',
        'file' => 'Розмір файлу має дорівнювати :size Кілобайт(а).',
        'string' => 'Кількість символів має дорівнювати :size.',
        'array' => 'Кількість елементів має дорівнювати :size.',
    ],
    'starts_with' => 'Значення має починатися з одного з таких значень: :values',
    'string' => 'Тут має бути рядок.',
    'timezone' => 'Повинен бути дійсний часовий пояс.',
    'unique' => 'Таке значення вже існує.',
    'uploaded' => 'Завантаження не вдалося.',
    'url' => 'Помилковий формат URL.',
    'uuid' => 'Повинен бути коректний UUID.',

    /*
    |--------------------------------------------------------------------------
    | Власні мовні ресурси для перевірки значень
    |--------------------------------------------------------------------------
    |
    | Тут Ви можете вказати власні повідомлення для атрибутів.
    | Це дозволяє легко вказати своє повідомлення для заданого правила атрибута.
    |
    | http://laravel.com/docs/validation#custom-error-messages
    | Приклад використання
    |
    | 'custom' => [
    | 'email' => [
    | 'required' => 'Нам необхідно знати Вашу електронну адресу!',
    | ],
    | ],
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],
];
